Revit 2027 API
IFCParameterTemplate.ClearPropertySets Method
 Removes all property sets from the template.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ClearPropertySets(
	PropertySetupType propertySetupType
)
Public Sub ClearPropertySets (
	propertySetupType As PropertySetupType
)
public:
void ClearPropertySets(
	PropertySetupType propertySetupType
)
member ClearPropertySets :
        propertySetupType : PropertySetupType -> unit
Parameters
propertySetupType PropertySetupType
 The property setup type.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
IFCParameterTemplate Class
Autodesk.Revit.DB Namespace